
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       14 |           8 |           12 |
## Affected resources by action

|  Action  | Resources                                                                      |
|:--------:|:-------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.random_uuid.installation-id`                            |
|    🟢    | `module.actions-runner-noble.random_uuid.installation-id`                      |
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`                   |
|    🟡    | `module.actions-runner.aws_launch_template.actions-runner`                     |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`             |
|    🟡    | `module.actions-runner-noble.aws_launch_template.actions-runner`               |
|    🟡    | `module.actions-runner.module.deregistration.aws_lambda_function.lambda`       |
|    🟡    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`        |
|    🟡    | `module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda` |
|    🟡    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda`  |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
      ~ health_check_grace_period        = 900 -> 60
        id                               = "actions-runner-20250505203133108100000007-INx3ry"
        name                             = "actions-runner-20250505203133108100000007-INx3ry"
        # (30 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-08b47595a3bdafaf1"
            name    = "actions-runner-20250505203133108100000007"
          ~ version = "1" -> (known after apply)
        }

        # (12 unchanged blocks hidden)
    }

  # module.actions-runner.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-08b47595a3bdafaf1"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "actions-runner-20250505203133108100000007"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHZGw0ZkFCRUFDc2E1ZnhWWDRWZU1XaEZRakdKQ01JNjF1d1BaWTlUbktKNHYza3IrMDVXSnZlcERxVgogICAgICAgIGpqWUxlSlEycHowVnBQajFvTnpEaWRNUUNxRW1vbzZuNlNtMEJ0eDl2UkNUa29pd3JteGhRM2ptTEwwK0VyeVMKICAgICAgICB5Qy9rakZQN2VhWjgzQXl6cG1VYyt1ZkcvUVN4RjBUYXJnUCtDU2tBNEFZSXMrREJwVkdiT1FJNFpSampsWHN6CiAgICAgICAgcTFMa2Q0NE9oZlk0RUcyaFBwTGNsblJ1YkJFYzB1OWRNRERuNFJidGpydTdscnkzUm9ML1gwTjM5RjA3SVlYOQogICAgICAgIEZ6c1gvYVdkVlcwTkdFRnBsM3ZjSmt3cTBuQ3dZTE1UT2tpNXMrYW1xVVhmeWQrdUNUYzQ0LzBOU0d5OW9iclQKICAgICAgICBHQU95STVzcE9VU2FncG55WTFiK3Y4UVF5VExsMzJsUWt5aWZMQUtneEo0UjJZM1d3UDZLTjljYnlGQXBCeEtHCiAgICAgICAgNFpwdXU5TGpwVVdpeStzb0tGM242T1R1RW1GMUpQaXRNNHV0Z2l3a2l1cTF4SFlMWGsvcEpEMGVOS0xUanJMMgogICAgICAgIDg2VVJYc0prT00vSVpydm82dXZ1MkFMVjhvMm1qbUlyajd2UzArUzZEZ2hGcEZGOU5YVjQrY3lXelJnV2hkQzcKICAgICAgICBCWnluTnRIb2c0M2RRQnNSaXVUWkJDV0lvUWtjUU5FeTVHT24vRHdqSWdJT21aSy9UaW9nNzU5NkFxaDVlS001CiAgICAgICAgU2F0ekJDUVNVenNFYVl4YlEwNU9OMkdxMzBOd1ludHlHdDZNamdjcWNlanprWlBHSzR6WFpSL2p3N1dQQTNHKwogICAgICAgIElQRzlNRTM3Y3BZNGk1Q2ZxcVYzbmpjeXJIY01TSW03aExWZVZxQU5vb1J1NjlXYk1CRjRrQVhuV1FBUkFRQUIKICAgICAgICB0R05KYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRTl5CiAgICAgICAgWVdOMWJHRnlJSEpsY0c5emFYUnZjbmtwSUR4d1lXTnJZV2RsY2kxdmNtRmpkV3hoY2tCcGJtWnlZV2h2ZFhObAogICAgICAgIExtTnZiVDZKQWxjRUV3RUtBRUVXSVFROVJHaUZuZ2JReHU1VVhTTmhjTkRiK3ZicDhnVUNaMlhoOEFJYkF3VUoKICAgICAgICBBOEpuQUFVTENRZ0hBZ0lpQWdZVkNna0lDd0lFRmdJREFRSWVCd0lYZ0FBS0NSQmhjTkRiK3ZicDhtbGVELzBkCiAgICAgICAgdjZDeklqMHJVeW1YUjZoQjVNWWlFSCtBbG1jcEVITyswQ3dvU3lGQzRlN3dkczFJcTBUVW9jTXl6WWxVUjhzQgogICAgICAgIGEreTJLTUd2bE5aQmVuSUtvcjAwNit6ZXdET21aWmJzOEt6YXZHQy9kTDlybU9uSTNiK1lkamFoUC95dm9rcHMKICAgICAgICAwM0kzSHNPRjlJaE9LdjZTbWczZ0QrSzFnRFUxVlFTWGRjZ2l5WDMyZFNaaG45WVJnUzhCcDUxSERNNHZzZmEzCiAgICAgICAgb2hvN0FLT3V5ZWx5V1VpNml5ZTF2L3d3Vjg5dE8rZkhSZzBGZUdBNWc4WnRYRFcyOUNPUDRnZy94OVhiRlVpNgogICAgICAgIEdGeUs2RVlGdm5zZHp2elRWN0pYeHRnMStQa2xveEpWRFJBZm5PUUdCTlh4TGRjM05jaTIwd09Ia2NHZEZJNnMKICAgICAgICBXN0tIMFZhOXh3c1QreHlRQTY1dm0xS1l6R0ordHN5ZTE5M1o0enZpM0pFbklkNFpZVU1aWEM2cTlnZWFLRktsCiAgICAgICAgRGx6dEZWWDUyUENHeGs1MlloSlB3WWNiOEpFRzNweE80eHdtRU9rOVRwTnRsVk1DZVgzZWFGYk5SVDJwWXJYYQogICAgICAgIEREL2ZCT2ZPRis1S3MxM0RBL3pKbnFwSHprbVNuNWdLOFdvR3U3UXUxZnpLNzJMY1RxYi82SnllSW04UlNydUUKICAgICAgICBiems2V0tYalB0eVhyczRWUStkMlhyOHk4Yk5nR3JCWDNUdVlhaVR2L05ka0hlaERvcXZzb0J1czQ4OS9DVVlaCiAgICAgICAgbU52MEt6c3pINWx6UHl2aTlyaURVUVJFZjNpcXhsLzVZMmFhTStWZHhoWGVmN3pJbzhpdDllcnZVMU5qaExzdAogICAgICAgIGh5MG9zbGxuWEg1TnZia1NZSEw3ZEV2N0NYVlhIb0JIUjFhcHJNdzJpYmtDRFFSblplSHdBUkFBMzA4aHRvMzAKICAgICAgICBuTEwwYy83NUU5YlFSTUJFOGFVaDdzd3JiUGo0bWlXeEhsemJXZFRzVjE3UDhEUFhuSlo2ZXE4VlVqcDYyWEh5CiAgICAgICAgS3J4YksvZTVXYWZoTWVuQlhDeWcxZVNkbjduMHI5bmIwRzlOS3hRNU84NlI1cFlaVmhERElIK3pNRnI2Y3BiMwogICAgICAgIEpSOWhsaEhPV3c5bktOU3VhMFRTL2FoS25DUWV3eDJ2MmNseERPaEc5QnN4ZlArT1l5a2tUSEx2QlZGbjh4S0oKICAgICAgICBRclpidGtuUE9BZDBxYUsxampuZ1JpYUpOWHlWWkJEVkFmUFhZYU5yS09ya3FCd1RZakdIR1lHdTNZUXdwNThOCiAgICAgICAgSjM5QjFPeXQ4emM3aFFublFLd1hRZ2ZFaE9uTFpGbDhhSkRBb2pQa0JlcHduc0tQTVo5RnVrQXQ5RHBab1VYdQogICAgICAgIDVtT2QzZFEzZDFKQTRvVXZTS1Z1TWtXWnc0ZXRPbDlDbHplSnhZV3ZsRGM4eFBHc0k5QU9xZmdJYXFDWmpFOXUKICAgICAgICAvb3kzeExEcjkrbjlmNEV5YXpraXhQTWNtL29Pd3RrUmZ4WjlKYU5TVFJ5S1JwZFRPZDJ6T21nNFA5TUVabm5kCiAgICAgICAgNkozSDFENnFmYkVJYUc3SGt2RVc3YzFuTHBXMnhyTjZXWjZreTZGd1ppZDAzajlOMVg3YTV3WkpaaVQ0Z1l1dAogICAgICAgIFN6SXo0UlMyamJrWmd5NGdCV2krc0lmZDliVGtWRzcvNVNCam4wV0E5NWtJS3I1MjVXVlgrS3dtNXFrYU5IZE4KICAgICAgICBnT3FLL3BkS1gzUTNOS1hURG1CV3VPcnRoSEk1TUxHYVBLd3hDVnhaSTI3MGpvVXhQbjJmYUh5emRQNWNiTm9mCiAgICAgICAgZGlVd25XVVVVY0MxVVVlU0gzRVo0YjJQaUFTdmhKNDl0TDhBRVFFQUFZa0NQQVFZQVFvQUpoWWhCRDFFYUlXZQogICAgICAgIEJ0REc3bFJkSTJGdzBOdjY5dW55QlFKblplSHdBaHNNQlFrRHdtY0FBQW9KRUdGdzBOdjY5dW55Y1NBUC8yZ3IKICAgICAgICBFMUdlVXhGNmVyQUxpd2E4c1djQVV5YXlaMTBCa0VxLzVZay9VSUZQODd4WEJTdnJQdERPQnFWbjErVkxFSm9PCiAgICAgICAgM1ZzNEU5SGVmZFUrWmRwTEY5bUkrZy9hZlNwdi9lbFduczdmL3IwK0IzS0RYVE8reExBaS9hUlVVTmZlcVdCTQogICAgICAgIFVscXQ5ZXJGZXJOUUNPNm4zTE02N3NYMkhNQ205TlJXT2J5NXF2dU1sZlhhNG11NERRbjR6c2VoUWw0NENWaFYKICAgICAgICBIMllnWXZ0MzJNcmRFVmZVN2w1dmlWMWtTc1FFRC83ZCs3WTIwMTZYdDN5RWFMbVFITGM1ejRhZjA1Vyt6N3N4CiAgICAgICAgcE5MNk52WXgrd2NQdmxKZ0R3V1lzbzhMZFZ2NEY0ZG9xYURXOTFyMHJXUnd6d0w0bGwvTmJOWG9GRjlTWm0rMwogICAgICAgIENMVXJ5a1NvRHNmUDAzSHh2bWxqMGQwZ2g2TVhwSGVldjk3eXBBNzgxREd1cTg4VkpYUXNZa0JSOUxBWlh4VFoKICAgICAgICB1eDBWd1FTdXJYbUFKaDdrUlppV1U4cURlcXFXNGVNTktKL3BQZVRreE5lSkdHNzNrZlUvQWo5eDg2U2pEazZtCiAgICAgICAgSE40dlBKWmhQcExZL2ROZFhsT0dVMWE0eG53MXYyT2xuRkY0bmp0V2g3SzlSQk4ybUdidjVabDQvTDVMa2RjVgogICAgICAgIEh6cU0rd0VwbEpLamFFd3BQQjIyZDdKZjZtZ004bHF4VWx2TnRSSmlnMEtoeGJkQnpQdTF2K041cTRWR2NKZVgKICAgICAgICBKRHhYd3pUZTRGYXRpcU9jTTBZTmFuTlYvcElVNU1SUlpiYVVlUnM4Z0hxUlc5eGNXVTlZYXh2UllaUklvc0l4CiAgICAgICAgRHpjWHVGMGcxS01sY3hyWTRoanJ1Q0lnazJsMytZWktHODJXRVdhegogICAgICAgID11cGxRCiAgICAgICAgLS0tLS1FTkQgUEdQIFBVQkxJQyBLRVkgQkxPQ0stLS0tLQogICAgICAic291cmNlIjogImRlYiBbc2lnbmVkLWJ5PSRLRVlfRklMRV0gaHR0cHM6Ly9yZWxlYXNlLW9yYWN1bGFyLmluZnJhaG91c2UuY29tLwogICAgICAgICRSRUxFQVNFIG1haW4iCiJwYWNrYWdlX3VwZGF0ZSI6IHRydWUKInBhY2thZ2VzIjoKLSAibWFrZSIKLSAiZ2NjIgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJydWJ5LXJ1YnlnZW1zIgotICJydWJ5LWRldiIKLSAiZGViaGVscGVyIgotICJkZXZzY3JpcHRzIgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgotICJnb2xhbmciCi0gImh1Z28iCi0gIm5vZGVqcyIKLSAibnBtIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInJ1bmNtZCI6Ci0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwganNvbiIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLWNvcmUiCi0gIlBBVEg9L29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW46JFBBVEggZ2VtIGluc3RhbGwgYXdzLXNkay1zZWNyZXRzbWFuYWdlciIKLSAiaWgtcHVwcGV0ICAtLWVudmlyb25tZW50IGRldmVsb3BtZW50IC0tZW52aXJvbm1lbnRwYXRoIHtyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzCiAgLS1yb290LWRpcmVjdG9yeSAvb3B0L3B1cHBldC1jb2RlIC0taGllcmEtY29uZmlnIC9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbAogIC0tbW9kdWxlLXBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlcwogIGFwcGx5IC9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwIgotICJpaC1hd3MgLS12ZXJib3NlIGF1dG9zY2FsaW5nIGNvbXBsZXRlIGJvb3RzdHJhcCIKIndyaXRlX2ZpbGVzIjoKLSAiY29udGVudCI6ICJleHBvcnQgQVdTX0RFRkFVTFRfUkVHSU9OPXVzLXdlc3QtMSIKICAicGF0aCI6ICIvZXRjL3Byb2ZpbGUuZC9hd3Muc2giCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogImRldmVsb3BtZW50IgogICAgInB1cHBldF9yb2xlIjogImdoYV9ydW5uZXIiCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL3B1cHBldC55YW1sIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImloLXB1cHBldFwiOntcImNhbmNlbF9pbnN0YW5jZV9yZWZyZXNoX29uX2Vycm9yXCI6ZmFsc2UsXCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L2hpZXJhLnlhbWxcIixcIm1hbmlmZXN0XCI6XCIvb3B0L3B1cHBldC1jb2RlL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9tYW5pZmVzdHMvc2l0ZS5wcFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzL3tlbnZpcm9ubWVudH0vbW9kdWxlczp7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXNcIixcInJvb3QtZGlyZWN0b3J5XCI6XCIvb3B0L3B1cHBldC1jb2RlXCJ9fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvaWgtcHVwcGV0Lmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiYm9vdHN0cmFwX2hvb2tuYW1lXCI6XCJib290c3RyYXBcIixcImxhYmVsc1wiOltcIm9yYWN1bGFyXCIsXCJodWdvXCJdLFwicmVnaXN0cmF0aW9uX3Rva2VuX3NlY3JldF9wcmVmaXhcIjpcIkdILXJlZy10b2tlbi1JOTJLWkVcIn0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2N1c3RvbS5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfAogICAgZ2xvYmFsIDogewogICAgICAgICAgICBleHRlcm5hbC1kaXIgOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kLyIsCiAgICB9CiAgInBhdGgiOiAiL2V0Yy9mYWN0ZXIvZmFjdGVyLmNvbmYiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K" -> (known after apply)
userdata changes:
--- before
+++ after
@@ -1,122 +1 @@
-Content-Type: multipart/mixed; boundary="MIMEBOUNDARY"
-MIME-Version: 1.0
-
---MIMEBOUNDARY
-Content-Transfer-Encoding: 7bit
-Content-Type: text/cloud-config
-Mime-Version: 1.0
-
-#cloud-config
-"apt":
-  "sources":
-    "infrahouse":
-      "key": |
-        -----BEGIN PGP PUBLIC KEY BLOCK-----
-
-        mQINBGdl4fABEACsa5fxVX4VeMWhFQjGJCMI61uwPZY9TnKJ4v3kr+05WJvepDqV
-        jjYLeJQ2pz0VpPj1oNzDidMQCqEmoo6n6Sm0Btx9vRCTkoiwrmxhQ3jmLL0+EryS
-        yC/kjFP7eaZ83AyzpmUc+ufG/QSxF0TargP+CSkA4AYIs+DBpVGbOQI4ZRjjlXsz
-        q1Lkd44OhfY4EG2hPpLclnRubBEc0u9dMDDn4Rbtjru7lry3RoL/X0N39F07IYX9
-        FzsX/aWdVW0NGEFpl3vcJkwq0nCwYLMTOki5s+amqUXfyd+uCTc44/0NSGy9obrT
-        GAOyI5spOUSagpnyY1b+v8QQyTLl32lQkyifLAKgxJ4R2Y3WwP6KN9cbyFApBxKG
-        4Zpuu9LjpUWiy+soKF3n6OTuEmF1JPitM4utgiwkiuq1xHYLXk/pJD0eNKLTjrL2
-        86URXsJkOM/IZrvo6uvu2ALV8o2mjmIrj7vS0+S6DghFpFF9NXV4+cyWzRgWhdC7
-        BZynNtHog43dQBsRiuTZBCWIoQkcQNEy5GOn/DwjIgIOmZK/Tiog7596Aqh5eKM5
-        SatzBCQSUzsEaYxbQ05ON2Gq30NwYntyGt6MjgcqcejzkZPGK4zXZR/jw7WPA3G+
-        IPG9ME37cpY4i5CfqqV3njcyrHcMSIm7hLVeVqANooRu69WbMBF4kAXnWQARAQAB
-        tGNJbmZyYUhvdXNlIFBhY2thZ2VyIChrZXkgZm9yIHNpZ25pbmcgVWJ1bnR1IE9y
-        YWN1bGFyIHJlcG9zaXRvcnkpIDxwYWNrYWdlci1vcmFjdWxhckBpbmZyYWhvdXNl
-        LmNvbT6JAlcEEwEKAEEWIQQ9RGiFngbQxu5UXSNhcNDb+vbp8gUCZ2Xh8AIbAwUJ
-        A8JnAAULCQgHAgIiAgYVCgkICwIEFgIDAQIeBwIXgAAKCRBhcNDb+vbp8mleD/0d
-        v6CzIj0rUymXR6hB5MYiEH+AlmcpEHO+0CwoSyFC4e7wds1Iq0TUocMyzYlUR8sB
-        a+y2KMGvlNZBenIKor006+zewDOmZZbs8KzavGC/dL9rmOnI3b+YdjahP/yvokps
-        03I3HsOF9IhOKv6Smg3gD+K1gDU1VQSXdcgiyX32dSZhn9YRgS8Bp51HDM4vsfa3
-        oho7AKOuyelyWUi6iye1v/wwV89tO+fHRg0FeGA5g8ZtXDW29COP4gg/x9XbFUi6
-        GFyK6EYFvnsdzvzTV7JXxtg1+PkloxJVDRAfnOQGBNXxLdc3Nci20wOHkcGdFI6s
-        W7KH0Va9xwsT+xyQA65vm1KYzGJ+tsye193Z4zvi3JEnId4ZYUMZXC6q9geaKFKl
-        DlztFVX52PCGxk52YhJPwYcb8JEG3pxO4xwmEOk9TpNtlVMCeX3eaFbNRT2pYrXa
-        DD/fBOfOF+5Ks13DA/zJnqpHzkmSn5gK8WoGu7Qu1fzK72LcTqb/6JyeIm8RSruE
-        bzk6WKXjPtyXrs4VQ+d2Xr8y8bNgGrBX3TuYaiTv/NdkHehDoqvsoBus489/CUYZ
-        mNv0KzszH5lzPyvi9riDUQREf3iqxl/5Y2aaM+VdxhXef7zIo8it9ervU1NjhLst
-        hy0osllnXH5NvbkSYHL7dEv7CXVXHoBHR1aprMw2ibkCDQRnZeHwARAA308hto30
-        nLL0c/75E9bQRMBE8aUh7swrbPj4miWxHlzbWdTsV17P8DPXnJZ6eq8VUjp62XHy
-        KrxbK/e5WafhMenBXCyg1eSdn7n0r9nb0G9NKxQ5O86R5pYZVhDDIH+zMFr6cpb3
-        JR9hlhHOWw9nKNSua0TS/ahKnCQewx2v2clxDOhG9BsxfP+OYykkTHLvBVFn8xKJ
-        QrZbtknPOAd0qaK1jjngRiaJNXyVZBDVAfPXYaNrKOrkqBwTYjGHGYGu3YQwp58N
-        J39B1Oyt8zc7hQnnQKwXQgfEhOnLZFl8aJDAojPkBepwnsKPMZ9FukAt9DpZoUXu
-        5mOd3dQ3d1JA4oUvSKVuMkWZw4etOl9ClzeJxYWvlDc8xPGsI9AOqfgIaqCZjE9u
-        /oy3xLDr9+n9f4EyazkixPMcm/oOwtkRfxZ9JaNSTRyKRpdTOd2zOmg4P9MEZnnd
-        6J3H1D6qfbEIaG7HkvEW7c1nLpW2xrN6WZ6ky6FwZid03j9N1X7a5wZJZiT4gYut
-        SzIz4RS2jbkZgy4gBWi+sIfd9bTkVG7/5SBjn0WA95kIKr525WVX+Kwm5qkaNHdN
-        gOqK/pdKX3Q3NKXTDmBWuOrthHI5MLGaPKwxCVxZI270joUxPn2faHyzdP5cbNof
-        diUwnWUUUcC1UUeSH3EZ4b2PiASvhJ49tL8AEQEAAYkCPAQYAQoAJhYhBD1EaIWe
-        BtDG7lRdI2Fw0Nv69unyBQJnZeHwAhsMBQkDwmcAAAoJEGFw0Nv69unycSAP/2gr
-        E1GeUxF6erALiwa8sWcAUyayZ10BkEq/5Yk/UIFP87xXBSvrPtDOBqVn1+VLEJoO
-        3Vs4E9HefdU+ZdpLF9mI+g/afSpv/elWns7f/r0+B3KDXTO+xLAi/aRUUNfeqWBM
-        Ulqt9erFerNQCO6n3LM67sX2HMCm9NRWOby5qvuMlfXa4mu4DQn4zsehQl44CVhV
-        H2YgYvt32MrdEVfU7l5viV1kSsQED/7d+7Y2016Xt3yEaLmQHLc5z4af05W+z7sx
-        pNL6NvYx+wcPvlJgDwWYso8LdVv4F4doqaDW91r0rWRwzwL4ll/NbNXoFF9SZm+3
-        CLUrykSoDsfP03Hxvmlj0d0gh6MXpHeev97ypA781DGuq88VJXQsYkBR9LAZXxTZ
-        ux0VwQSurXmAJh7kRZiWU8qDeqqW4eMNKJ/pPeTkxNeJGG73kfU/Aj9x86SjDk6m
-        HN4vPJZhPpLY/dNdXlOGU1a4xnw1v2OlnFF4njtWh7K9RBN2mGbv5Zl4/L5LkdcV
-        HzqM+wEplJKjaEwpPB22d7Jf6mgM8lqxUlvNtRJig0KhxbdBzPu1v+N5q4VGcJeX
-        JDxXwzTe4FatiqOcM0YNanNV/pIU5MRRZbaUeRs8gHqRW9xcWU9YaxvRYZRIosIx
-        DzcXuF0g1KMlcxrY4hjruCIgk2l3+YZKG82WEWaz
-        =uplQ
-        -----END PGP PUBLIC KEY BLOCK-----
-      "source": "deb [signed-by=$KEY_FILE] https://release-oracular.infrahouse.com/
-        $RELEASE main"
-"package_update": true
-"packages":
-- "make"
-- "gcc"
-- "puppet-code"
-- "infrahouse-toolkit"
-- "ruby-rubygems"
-- "ruby-dev"
-- "debhelper"
-- "devscripts"
-- "infrahouse-puppet-data"
-- "golang"
-- "hugo"
-- "nodejs"
-- "npm"
-- "make"
-- "python-is-python3"
-"runcmd":
-- "PATH=/opt/puppetlabs/puppet/bin:$PATH gem install json"
-- "PATH=/opt/puppetlabs/puppet/bin:$PATH gem install aws-sdk-core"
-- "PATH=/opt/puppetlabs/puppet/bin:$PATH gem install aws-sdk-secretsmanager"
-- "ih-puppet  --environment development --environmentpath {root_directory}/environments
-  --root-directory /opt/puppet-code --hiera-config /opt/infrahouse-puppet-data/environments/development/hiera.yaml
-  --module-path {root_directory}/environments/{environment}/modules:{root_directory}/modules
-  apply /opt/puppet-code/environments/development/manifests/site.pp"
-- "ih-aws --verbose autoscaling complete bootstrap"
-"write_files":
-- "content": "export AWS_DEFAULT_REGION=us-west-1"
-  "path": "/etc/profile.d/aws.sh"
-  "permissions": "0644"
-- "content": |-
-    [default]
-    region=us-west-1
-  "path": "/root/.aws/config"
-  "permissions": "0600"
-- "content": |
-    "puppet_environment": "development"
-    "puppet_role": "gha_runner"
-  "path": "/etc/puppetlabs/facter/facts.d/puppet.yaml"
-  "permissions": "0644"
-- "content": "{\"ih-puppet\":{\"cancel_instance_refresh_on_error\":false,\"debug\":false,\"environmentpath\":\"{root_directory}/environments\",\"hiera-config\":\"/opt/infrahouse-puppet-data/environments/development/hiera.yaml\",\"manifest\":\"/opt/puppet-code/environments/development/manifests/site.pp\",\"module-path\":\"{root_directory}/environments/{environment}/modules:{root_directory}/modules\",\"root-directory\":\"/opt/puppet-code\"}}"
-  "path": "/etc/puppetlabs/facter/facts.d/ih-puppet.json"
-  "permissions": "0644"
-- "content": "{\"bootstrap_hookname\":\"bootstrap\",\"labels\":[\"oracular\",\"hugo\"],\"registration_token_secret_prefix\":\"GH-reg-token-I92KZE\"}"
-  "path": "/etc/puppetlabs/facter/facts.d/custom.json"
-  "permissions": "0644"
-- "content": |
-    global : {
-            external-dir : "/etc/puppetlabs/facter/facts.d/",
-    }
-  "path": "/etc/facter/facter.conf"
-  "permissions": "0644"
-
---MIMEBOUNDARY--
+(known after apply)
EOF userdata changes.
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner.random_uuid.installation-id will be created
  + resource "random_uuid" "installation-id" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
      ~ health_check_grace_period        = 900 -> 60
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
        # (30 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0fe52afb929ab485f"
            name    = "actions-runner-20250505203133193000000009"
          ~ version = "1" -> (known after apply)
        }

        # (12 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-0fe52afb929ab485f"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "actions-runner-20250505203133193000000009"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHYWI1RVVCRUFDeGVBOHpvQkVZWXF6cDljQmpYb3VEWlAyeXVmN0RTUFNFenhjYjZuVitLaUlwNkwzcgogICAgICAgIG5PVE9uaTAxZHBON1JFdXAwbHArekdDRU5XRDBpTlJySGdPMG5rTmF1RFNCMzRrOGdpdVhMdzVzUytzeXFyOHUKICAgICAgICBJdDBsbW1xeW1kTXFtbXAxRER2REhtYlJ2YS9MY0daZlhwV1Nvdk53d0wrR3hHemFxbnluSmIvMmxLOVEyRnU0CiAgICAgICAgNERMRkMvVnlkM2ZTa0dmUm1pcHJoSmM5OGV4ODRGK3UxRGNJWE91QnNFRWZ5bGtKNFROcmFyMDNHTTFoWFJWOQogICAgICAgIDhXUTdCQ2loTkhZOWp2MzBpLzlPRGhSZkh0ZGdKbWNCVEhBdWRKK1cxWDIyNXFIblViYjE2MnJGSVJDb0JaL2UKICAgICAgICAwOHl5NUFnd2d2OHY2Z3dMZm11cGFIanFYSC9DUmhHV0p0eVhidjAyTHRNVVlSaEFqZ2VmV3NZTy9heHlIVStiCiAgICAgICAgVmhHSkdqSll6SU5VMWg2UFYxcnV4cWd3RW13cWZ3dmlxaEJmbHZ6WUdlRGNQT2hUekRNR0Yzb2JNckg2a1dSNAogICAgICAgIEI1aHVvZ0M5dVR6MzkxcWl2Tml1NFVDL0I3elpwWlRSeDNpbkljUjdrYytYcDdhcG1aWmVWZXg3K3hiNE9qNW0KICAgICAgICAxMkpKQzRrcVFqOFEwSFpYK0tWbkJjaUN6eHJOeit2bFExcUcvU2NYejFlM3dQM05iMUVqR0YrVFVhUGtPM3ZMCiAgICAgICAgSVM1Z0JXQ0p4ODgzY2w2WWtZWE9BVTZ1dzlIWTNZcFNMc3RBcEREZ3hJNmp1MHA4UkUrSE9MRkp5RkxPd0pmTQogICAgICAgIGNucmZMU05JUXVYZHBFajNhZlVOc2hiNDVPUlhaTGlXVURrMDdaZGlyOWkrL0pFNFNPRnBSdWxBVHdBUkFRQUIKICAgICAgICB0RjFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRzV2CiAgICAgICAgWW14bElISmxjRzl6YVhSdmNua3BJRHh3WVdOcllXZGxjaTF1YjJKc1pVQnBibVp5WVdodmRYTmxMbU52YlQ2SgogICAgICAgIEFsY0VFd0VJQUVFV0lRU21KN2QyQUJrTHBSdVFORlBUZWhnYmFKcldHUVVDWnB2a1JRSWJBd1VKQThKbkFBVUwKICAgICAgICBDUWdIQWdJaUFnWVZDZ2tJQ3dJRUZnSURBUUllQndJWGdBQUtDUkRUZWhnYmFKcldHVGpzRC85VE5PeGVLZFQ2CiAgICAgICAgNXQvQjBRd2tsK3hyL1NWWm1hVTUvTmJFd1hXdjQwbzMrOXN4UkdBU25RMDl6RTZicEdkektkcUVWUEZlb3VGSwogICAgICAgIFllRHRIVE9LMjArc2l1YkhwMnY0VDBCRHhNMk5HR3Q5cndERmx2L0pDbmY3aXJiVHdyU3FjbzlYck02U3R0NGQKICAgICAgICA4dmlZZXYyclNYSGZ5REdudkduWjM1TFVtSHlHRmx5ekdQVTlNZXI3VnNrWE5EOGUyQkZ4ajduR1RMYlZkNzZMCiAgICAgICAgS0JQOWRFWVJiMTRGTFpxS3Z4cXFiZkp0bFhJNmdnZDdNdVVsbjBpWTBOcWtZVUN0TnZQK0dpbk5tY3Vla21CcwogICAgICAgIFpzbkRPS0JFRFdhMHBEOWJ6bktGNmZWQ2h3aUc2aWFjSDVuWnRlVFE5Uk5tTVpoUStFKzBQTWtpSnlhNnU5UDUKICAgICAgICAreFAwaU05ODRvY2d6S0NMWTFmc0pMUTdGZG54MGdRVkt0S1o5YnBBeS9BWC9uMlZ0cTFLUmNQUHVrbFFUYk92CiAgICAgICAgRHhBajczbWxKL2hSZUVXWDlDL004bE1MZ01EQU1EUUdObC9XVEN1UlB5d1N6MXZ3RHVYMVNLaTBOSno5ZTc2RAogICAgICAgIHFJR1IzSkhVSTBjUHJDODluWW1FdUg0UEtqcytZRGRoa1ZNeGZIVlc2azFzTWNiclJFdm9SdzJjcWZiajk2Sk8KICAgICAgICBKU0VBWEVrdGRIbmJDa1FJd0pUQTM2M20rOVhVSzQ5a29jNWlnc09ORzQrN0hvb3QrZWxQMDZXZ2VsS1BzV3ZqCiAgICAgICAgaUNVWG1vL3ppaGhQYTRVNytYbEJYdURjRFROUmtUc1VzNDJ2eXRnSXBpWkFHTDNPekk1UXpiWjRTcWV3TDVzUAogICAgICAgIHFCdGdOTWp5SVhjNmhCbE9WUGJaYWRvVlczdk5MK2tlK2JrQ0RRUm1tK1JGQVJBQXV0cVFLbzlub08yMHIyci8KICAgICAgICBTWmZHQjluMjFPSitoaHhXZ2laaFNGVTRFNnhmSmowVHIxTWJiZ0ppeXhFSUVSZHBjRzNMRWtTQnhMaXF3RitqCiAgICAgICAgYzFlSHRERHpRbDk2OEFLTGN4a2pJcUZYVjF6V2hTRTFTVFV6WllyTHh0SkwwWDYwdnlOZXJHY3JJYng2dFR4SwogICAgICAgIDIvVEhBQmVab1hqTENhNGVZY1A1cVhYU2s4aVJuNGkxRUJTM2hITjR1Q0RIcHRFNVBsOTNqV0ptdXdvRWtZVHgKICAgICAgICBoeTVSN3haR0FLUHU0eXNmRG1nSVU4eVhlWThDYndDY2Exa2NvVnlNWjRERUdJd2gxSklJNmwzWEEzVldyY29FCiAgICAgICAgNUE4MTRBa2Z2aW80VTlBMjZFNCthR2cvUWdtdm9BNU9wdFo2YW8zV24vT0lON3NueEdnYXdDU3RPZVdyWFI5eQogICAgICAgIGZKYThIWVhKRGEvVG9FdHkwT1R4Z2lFeFFXWVBUYU82QWQvYzZjYWJJUnFnM1h2QzJsbGg4Rkc1V052UCs0bS8KICAgICAgICBGeTN5MnBEanljMndFTExCWlZvTDcwOUZkdFBGNGFqUTVrQ3k3ZlVKMi9zcUpEa1RYdGEzcWI0UnBURm9kSmRCCiAgICAgICAgMHd0Z0tmbXdqRTUvb2pBWUFFZ0lCVm54RXcvczR6MURjOWtxcFA0UDRVRUJxdjhaWHBCcHV6cGN0WDNESVlBeQogICAgICAgIG9PVTdYZTFDSWFIZGhQN2xicnlkb0pUeHJvd1I3WXowdHpvdGhqV2ZGQXFMMW9lOVhEcnl3YjMwKzlDVzRmQy8KICAgICAgICBvcTE4Z3phcUVBT0w4V3lGNHYzQkdzSHVGWjM0YVB0ZnJHczVNZUNvS3FnOHd6bi9mdklkMHk2dldxYXRQZmNzCiAgICAgICAgWXNuM0RDOTdiNThLMjhVUXlwcDlIWTlvYUtrQUVRRUFBWWtDUEFRWUFRZ0FKaFloQktZbnQzWUFHUXVsRzVBMAogICAgICAgIFU5TjZHQnRvbXRZWkJRSm1tK1JGQWhzTUJRa0R3bWNBQUFvSkVOTjZHQnRvbXRZWmpUOFAvMXJPYzk3S2syZkwKICAgICAgICBkZ1VZUDY2TVErNTFIMWlGaDRlalkzbzBqeEsza0NURThJaHJQZVZOSW9pTFpvaFFnUHJwRHBROWFRVDJnalNhCiAgICAgICAgWVBBVTl6QmwrV2lzaFFuckZmenZWVGNPNVBWMHhoVEtXdEJ0WmR6RnYwV2NJUnRtOWdPWVc1R2hCbTBPZjVCRQogICAgICAgIDZRb3hHODRuQW1mNWVVZGd4eFFxUG5XVkZUbnh4dyszM0Nudk9CMFpZTDJlb2o2U0V5bWEydFlyV0xMdGtUTnEKICAgICAgICA1TmdTUDB3R1c0U0ZuMEFhL0VpM01GUktGVXFpRnphZXkrdnJXa2hqMFZsNXNweGYxSzZ5ZGppbG1lNXlWc2JuCiAgICAgICAgZ0Z5bGROOTdUOFdyYzRtSGhNUTMvVjE5RHk3SkcrdEVhQjZXREErRnp4K3EyajF4OExwVG5HNWhZSjhYTzlNbwogICAgICAgIDdKUnFQMHN0a1B3anp1bWNPV1pkREZtNG9aODBPekZPOEpkaVBIVi9qS1llVlVrNDUySENLVGU4WElCT2RIbWMKICAgICAgICBwdVlBanRXaVErZzlpMlU4UzJRaGxvb2NtWXRJeDR5UnhnWTlxemMxN0tGREdsL3ZhanlpM1hkeUN1ZURLc3A3CiAgICAgICAgUXZqc2dkbU5tRnVkMjh3dXY4aEltUlRQMlBsMnJnMTdEM0tjaW1RUm4rR0ZCamlTbDVNZHd5dHk5Y2pYWE1lagogICAgICAgIDVRNVVEY1pFOVViVGp4OGJ0TkxlbnhlTXV3WEV4NjBDKzlRU3NZUEFiWHhWVVFRUXRSakpoekp2MHhqcVZ4dDAKICAgICAgICA4NWZKVjE3VXp6Y21ZdnlOS1hPd2VOdkNweFd2L0RZSk5GOTQrb29ZL3JvT0o0VDJzMjQwS0VOck04aDZOVGV4CiAgICAgICAgaGQvMmp1eERQY1JnNlNzUms0dEpXRkZwa0FTclB4OFAKICAgICAgICA9WmhpRQogICAgICAgIC0tLS0tRU5EIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KICAgICAgInNvdXJjZSI6ICJkZWIgW3NpZ25lZC1ieT0kS0VZX0ZJTEVdIGh0dHBzOi8vcmVsZWFzZS1ub2JsZS5pbmZyYWhvdXNlLmNvbS8gJFJFTEVBU0UKICAgICAgICBtYWluIgoicGFja2FnZV91cGRhdGUiOiB0cnVlCiJwYWNrYWdlcyI6Ci0gIm1ha2UiCi0gImdjYyIKLSAicHVwcGV0LWNvZGUiCi0gImluZnJhaG91c2UtdG9vbGtpdCIKLSAicnVieS1ydWJ5Z2VtcyIKLSAicnVieS1kZXYiCi0gImRlYmhlbHBlciIKLSAiZGV2c2NyaXB0cyIKLSAiaW5mcmFob3VzZS1wdXBwZXQtZGF0YSIKLSAiZ29sYW5nIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInB1cHBldCI6CiAgImNvbGxlY3Rpb24iOiAicHVwcGV0OCIKICAiaW5zdGFsbCI6IHRydWUKICAiaW5zdGFsbF90eXBlIjogImFpbyIKICAicGFja2FnZV9uYW1lIjogInB1cHBldC1hZ2VudCIKICAic3RhcnRfc2VydmljZSI6IGZhbHNlCiAgInZlcnNpb24iOiAiOC4xMC4wIgoicnVuY21kIjoKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBqc29uIgotICJQQVRIPS9vcHQvcHVwcGV0bGFicy9wdXBwZXQvYmluOiRQQVRIIGdlbSBpbnN0YWxsIGF3cy1zZGstY29yZSIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLXNlY3JldHNtYW5hZ2VyIgotICJpaC1wdXBwZXQgIC0tZW52aXJvbm1lbnQgZGV2ZWxvcG1lbnQgLS1lbnZpcm9ubWVudHBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMKICAtLXJvb3QtZGlyZWN0b3J5IC9vcHQvcHVwcGV0LWNvZGUgLS1oaWVyYS1jb25maWcgL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sCiAgLS1tb2R1bGUtcGF0aCB7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cy97ZW52aXJvbm1lbnR9L21vZHVsZXM6e3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzCiAgYXBwbHkgL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHAiCi0gImloLWF3cyAtLXZlcmJvc2UgYXV0b3NjYWxpbmcgY29tcGxldGUgYm9vdHN0cmFwIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogImV4cG9ydCBBV1NfREVGQVVMVF9SRUdJT049dXMtd2VzdC0xIgogICJwYXRoIjogIi9ldGMvcHJvZmlsZS5kL2F3cy5zaCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6IHwtCiAgICBbZGVmYXVsdF0KICAgIHJlZ2lvbj11cy13ZXN0LTEKICAicGF0aCI6ICIvcm9vdC8uYXdzL2NvbmZpZyIKICAicGVybWlzc2lvbnMiOiAiMDYwMCIKLSAiY29udGVudCI6IHwKICAgICJwdXBwZXRfZW52aXJvbm1lbnQiOiAiZGV2ZWxvcG1lbnQiCiAgICAicHVwcGV0X3JvbGUiOiAiZ2hhX3J1bm5lciIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvcHVwcGV0LnlhbWwiCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiAie1wiaWgtcHVwcGV0XCI6e1wiY2FuY2VsX2luc3RhbmNlX3JlZnJlc2hfb25fZXJyb3JcIjpmYWxzZSxcImRlYnVnXCI6ZmFsc2UsXCJlbnZpcm9ubWVudHBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzXCIsXCJoaWVyYS1jb25maWdcIjpcIi9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvaGllcmEueWFtbFwiLFwibWFuaWZlc3RcIjpcIi9vcHQvcHVwcGV0LWNvZGUvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L21hbmlmZXN0cy9zaXRlLnBwXCIsXCJtb2R1bGUtcGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9tb2R1bGVzOntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJib290c3RyYXBfaG9va25hbWVcIjpcImJvb3RzdHJhcFwiLFwibGFiZWxzXCI6W1wibm9ibGVcIl0sXCJyZWdpc3RyYXRpb25fdG9rZW5fc2VjcmV0X3ByZWZpeFwiOlwiR0gtcmVnLXRva2VuLWM3SXdyZFwifSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvY3VzdG9tLmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K" -> (known after apply)
userdata changes:
--- before
+++ after
@@ -1,120 +1 @@
-Content-Type: multipart/mixed; boundary="MIMEBOUNDARY"
-MIME-Version: 1.0
-
---MIMEBOUNDARY
-Content-Transfer-Encoding: 7bit
-Content-Type: text/cloud-config
-Mime-Version: 1.0
-
-#cloud-config
-"apt":
-  "sources":
-    "infrahouse":
-      "key": |
-        -----BEGIN PGP PUBLIC KEY BLOCK-----
-
-        mQINBGab5EUBEACxeA8zoBEYYqzp9cBjXouDZP2yuf7DSPSEzxcb6nV+KiIp6L3r
-        nOTOni01dpN7REup0lp+zGCENWD0iNRrHgO0nkNauDSB34k8giuXLw5sS+syqr8u
-        It0lmmqymdMqmmp1DDvDHmbRva/LcGZfXpWSovNwwL+GxGzaqnynJb/2lK9Q2Fu4
-        4DLFC/Vyd3fSkGfRmiprhJc98ex84F+u1DcIXOuBsEEfylkJ4TNrar03GM1hXRV9
-        8WQ7BCihNHY9jv30i/9ODhRfHtdgJmcBTHAudJ+W1X225qHnUbb162rFIRCoBZ/e
-        08yy5Agwgv8v6gwLfmupaHjqXH/CRhGWJtyXbv02LtMUYRhAjgefWsYO/axyHU+b
-        VhGJGjJYzINU1h6PV1ruxqgwEmwqfwviqhBflvzYGeDcPOhTzDMGF3obMrH6kWR4
-        B5huogC9uTz391qivNiu4UC/B7zZpZTRx3inIcR7kc+Xp7apmZZeVex7+xb4Oj5m
-        12JJC4kqQj8Q0HZX+KVnBciCzxrNz+vlQ1qG/ScXz1e3wP3Nb1EjGF+TUaPkO3vL
-        IS5gBWCJx883cl6YkYXOAU6uw9HY3YpSLstApDDgxI6ju0p8RE+HOLFJyFLOwJfM
-        cnrfLSNIQuXdpEj3afUNshb45ORXZLiWUDk07Zdir9i+/JE4SOFpRulATwARAQAB
-        tF1JbmZyYUhvdXNlIFBhY2thZ2VyIChrZXkgZm9yIHNpZ25pbmcgVWJ1bnR1IG5v
-        YmxlIHJlcG9zaXRvcnkpIDxwYWNrYWdlci1ub2JsZUBpbmZyYWhvdXNlLmNvbT6J
-        AlcEEwEIAEEWIQSmJ7d2ABkLpRuQNFPTehgbaJrWGQUCZpvkRQIbAwUJA8JnAAUL
-        CQgHAgIiAgYVCgkICwIEFgIDAQIeBwIXgAAKCRDTehgbaJrWGTjsD/9TNOxeKdT6
-        5t/B0Qwkl+xr/SVZmaU5/NbEwXWv40o3+9sxRGASnQ09zE6bpGdzKdqEVPFeouFK
-        YeDtHTOK20+siubHp2v4T0BDxM2NGGt9rwDFlv/JCnf7irbTwrSqco9XrM6Stt4d
-        8viYev2rSXHfyDGnvGnZ35LUmHyGFlyzGPU9Mer7VskXND8e2BFxj7nGTLbVd76L
-        KBP9dEYRb14FLZqKvxqqbfJtlXI6ggd7MuUln0iY0NqkYUCtNvP+GinNmcuekmBs
-        ZsnDOKBEDWa0pD9bznKF6fVChwiG6iacH5nZteTQ9RNmMZhQ+E+0PMkiJya6u9P5
-        +xP0iM984ocgzKCLY1fsJLQ7Fdnx0gQVKtKZ9bpAy/AX/n2Vtq1KRcPPuklQTbOv
-        DxAj73mlJ/hReEWX9C/M8lMLgMDAMDQGNl/WTCuRPywSz1vwDuX1SKi0NJz9e76D
-        qIGR3JHUI0cPrC89nYmEuH4PKjs+YDdhkVMxfHVW6k1sMcbrREvoRw2cqfbj96JO
-        JSEAXEktdHnbCkQIwJTA363m+9XUK49koc5igsONG4+7Hoot+elP06WgelKPsWvj
-        iCUXmo/zihhPa4U7+XlBXuDcDTNRkTsUs42vytgIpiZAGL3OzI5QzbZ4SqewL5sP
-        qBtgNMjyIXc6hBlOVPbZadoVW3vNL+ke+bkCDQRmm+RFARAAutqQKo9noO20r2r/
-        SZfGB9n21OJ+hhxWgiZhSFU4E6xfJj0Tr1MbbgJiyxEIERdpcG3LEkSBxLiqwF+j
-        c1eHtDDzQl968AKLcxkjIqFXV1zWhSE1STUzZYrLxtJL0X60vyNerGcrIbx6tTxK
-        2/THABeZoXjLCa4eYcP5qXXSk8iRn4i1EBS3hHN4uCDHptE5Pl93jWJmuwoEkYTx
-        hy5R7xZGAKPu4ysfDmgIU8yXeY8CbwCca1kcoVyMZ4DEGIwh1JII6l3XA3VWrcoE
-        5A814Akfvio4U9A26E4+aGg/QgmvoA5OptZ6ao3Wn/OIN7snxGgawCStOeWrXR9y
-        fJa8HYXJDa/ToEty0OTxgiExQWYPTaO6Ad/c6cabIRqg3XvC2llh8FG5WNvP+4m/
-        Fy3y2pDjyc2wELLBZVoL709FdtPF4ajQ5kCy7fUJ2/sqJDkTXta3qb4RpTFodJdB
-        0wtgKfmwjE5/ojAYAEgIBVnxEw/s4z1Dc9kqpP4P4UEBqv8ZXpBpuzpctX3DIYAy
-        oOU7Xe1CIaHdhP7lbrydoJTxrowR7Yz0tzothjWfFAqL1oe9XDrywb30+9CW4fC/
-        oq18gzaqEAOL8WyF4v3BGsHuFZ34aPtfrGs5MeCoKqg8wzn/fvId0y6vWqatPfcs
-        Ysn3DC97b58K28UQypp9HY9oaKkAEQEAAYkCPAQYAQgAJhYhBKYnt3YAGQulG5A0
-        U9N6GBtomtYZBQJmm+RFAhsMBQkDwmcAAAoJENN6GBtomtYZjT8P/1rOc97Kk2fL
-        dgUYP66MQ+51H1iFh4ejY3o0jxK3kCTE8IhrPeVNIoiLZohQgPrpDpQ9aQT2gjSa
-        YPAU9zBl+WishQnrFfzvVTcO5PV0xhTKWtBtZdzFv0WcIRtm9gOYW5GhBm0Of5BE
-        6QoxG84nAmf5eUdgxxQqPnWVFTnxxw+33CnvOB0ZYL2eoj6SEyma2tYrWLLtkTNq
-        5NgSP0wGW4SFn0Aa/Ei3MFRKFUqiFzaey+vrWkhj0Vl5spxf1K6ydjilme5yVsbn
-        gFyldN97T8Wrc4mHhMQ3/V19Dy7JG+tEaB6WDA+Fzx+q2j1x8LpTnG5hYJ8XO9Mo
-        7JRqP0stkPwjzumcOWZdDFm4oZ80OzFO8JdiPHV/jKYeVUk452HCKTe8XIBOdHmc
-        puYAjtWiQ+g9i2U8S2QhloocmYtIx4yRxgY9qzc17KFDGl/vajyi3XdyCueDKsp7
-        QvjsgdmNmFud28wuv8hImRTP2Pl2rg17D3KcimQRn+GFBjiSl5Mdwyty9cjXXMej
-        5Q5UDcZE9UbTjx8btNLenxeMuwXEx60C+9QSsYPAbXxVUQQQtRjJhzJv0xjqVxt0
-        85fJV17UzzcmYvyNKXOweNvCpxWv/DYJNF94+ooY/roOJ4T2s240KENrM8h6NTex
-        hd/2juxDPcRg6SsRk4tJWFFpkASrPx8P
-        =ZhiE
-        -----END PGP PUBLIC KEY BLOCK-----
-      "source": "deb [signed-by=$KEY_FILE] https://release-noble.infrahouse.com/ $RELEASE
-        main"
-"package_update": true
-"packages":
-- "make"
-- "gcc"
-- "puppet-code"
-- "infrahouse-toolkit"
-- "ruby-rubygems"
-- "ruby-dev"
-- "debhelper"
-- "devscripts"
-- "infrahouse-puppet-data"
-- "golang"
-- "make"
-- "python-is-python3"
-"puppet":
-  "collection": "puppet8"
-  "install": true
-  "install_type": "aio"
-  "package_name": "puppet-agent"
-  "start_service": false
-  "version": "8.10.0"
-"runcmd":
-- "PATH=/opt/puppetlabs/puppet/bin:$PATH gem install json"
-- "PATH=/opt/puppetlabs/puppet/bin:$PATH gem install aws-sdk-core"
-- "PATH=/opt/puppetlabs/puppet/bin:$PATH gem install aws-sdk-secretsmanager"
-- "ih-puppet  --environment development --environmentpath {root_directory}/environments
-  --root-directory /opt/puppet-code --hiera-config /opt/infrahouse-puppet-data/environments/development/hiera.yaml
-  --module-path {root_directory}/environments/{environment}/modules:{root_directory}/modules
-  apply /opt/puppet-code/environments/development/manifests/site.pp"
-- "ih-aws --verbose autoscaling complete bootstrap"
-"write_files":
-- "content": "export AWS_DEFAULT_REGION=us-west-1"
-  "path": "/etc/profile.d/aws.sh"
-  "permissions": "0644"
-- "content": |-
-    [default]
-    region=us-west-1
-  "path": "/root/.aws/config"
-  "permissions": "0600"
-- "content": |
-    "puppet_environment": "development"
-    "puppet_role": "gha_runner"
-  "path": "/etc/puppetlabs/facter/facts.d/puppet.yaml"
-  "permissions": "0644"
-- "content": "{\"ih-puppet\":{\"cancel_instance_refresh_on_error\":false,\"debug\":false,\"environmentpath\":\"{root_directory}/environments\",\"hiera-config\":\"/opt/infrahouse-puppet-data/environments/development/hiera.yaml\",\"manifest\":\"/opt/puppet-code/environments/development/manifests/site.pp\",\"module-path\":\"{root_directory}/environments/{environment}/modules:{root_directory}/modules\",\"root-directory\":\"/opt/puppet-code\"}}"
-  "path": "/etc/puppetlabs/facter/facts.d/ih-puppet.json"
-  "permissions": "0644"
-- "content": "{\"bootstrap_hookname\":\"bootstrap\",\"labels\":[\"noble\"],\"registration_token_secret_prefix\":\"GH-reg-token-c7Iwrd\"}"
-  "path": "/etc/puppetlabs/facter/facts.d/custom.json"
-  "permissions": "0644"
-
---MIMEBOUNDARY--
+(known after apply)
EOF userdata changes.
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner-noble.random_uuid.installation-id will be created
  + resource "random_uuid" "installation-id" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.actions-runner.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.deregistration.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_deregistration"
      ~ last_modified                  = "2025-05-13T15:00:47.000+0000" -> (known after apply)
      ~ s3_key                         = "1863fbef-f2f3-9ab7-5984-e32cb76e505a.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ASG_NAME"                         = "actions-runner-20250505203133108100000007-INx3ry"
              - "GH_APP_ID"                        = "1016363"
              - "GITHUB_ORG_NAME"                  = "infrahouse"
              - "GITHUB_SECRET"                    = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              - "GITHUB_SECRET_TYPE"               = "pem"
              - "REGISTRATION_TOKEN_SECRET_PREFIX" = "GH-reg-token-I92KZE"
            } -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.deregistration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/1863fbef-f2f3-9ab7-5984-e32cb76e505a.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "89abbf89b1a9b743146c17383120ba77-5" -> (known after apply)
      ~ id                            = "1863fbef-f2f3-9ab7-5984-e32cb76e505a.zip" -> (known after apply)
      ~ key                           = "1863fbef-f2f3-9ab7-5984-e32cb76e505a.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_deregistration/1863fbef-f2f3-9ab7-5984-e32cb76e505a.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.deregistration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "7410853380866666364" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "c9bc5cebad6b81307c300f8d1e09723a" -> "6538831741a0f02462174590f7abb061"
          ~ "main_version"         = "0610829c0e634ca072d657f4557e894f" -> "8694bd493be5ffcf3fe3e600bf01c93c"
        }
    }

  # module.actions-runner.module.deregistration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "1863fbef-f2f3-9ab7-5984-e32cb76e505a" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "0610829c0e634ca072d657f4557e894f" -> "8694bd493be5ffcf3fe3e600bf01c93c"
          ~ "requirements.txt" = "c9bc5cebad6b81307c300f8d1e09723a" -> "6538831741a0f02462174590f7abb061"
        }
      ~ result  = "1863fbef-f2f3-9ab7-5984-e32cb76e505a" -> (known after apply)
    }

  # module.actions-runner.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_record_metric"
      ~ last_modified                  = "2025-05-13T01:38:30.738+0000" -> (known after apply)
      ~ s3_key                         = "337ef219-94f6-1ad2-9212-125be7321f7d.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ASG_NAME"           = "actions-runner-20250505203133108100000007-INx3ry"
              - "GH_APP_ID"          = "1016363"
              - "GITHUB_ORG_NAME"    = "infrahouse"
              - "GITHUB_SECRET"      = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              - "GITHUB_SECRET_TYPE" = "pem"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/337ef219-94f6-1ad2-9212-125be7321f7d.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "97b2b5736764c8b9f97d90324cb3d07e-5" -> (known after apply)
      ~ id                            = "337ef219-94f6-1ad2-9212-125be7321f7d.zip" -> (known after apply)
      ~ key                           = "337ef219-94f6-1ad2-9212-125be7321f7d.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/record_metric/337ef219-94f6-1ad2-9212-125be7321f7d.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "6854468968401459753" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "b27996808eca928c3e27d41ab0ab456d" -> "6538831741a0f02462174590f7abb061"
          ~ "main_version"         = "009a1509fd6c7174d1f87bf6bac70353" -> "c5ae631ac191c42c94824edb808a790e"
        }
    }

  # module.actions-runner.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "337ef219-94f6-1ad2-9212-125be7321f7d" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "009a1509fd6c7174d1f87bf6bac70353" -> "c5ae631ac191c42c94824edb808a790e"
          ~ "requirements.txt" = "b27996808eca928c3e27d41ab0ab456d" -> "6538831741a0f02462174590f7abb061"
        }
      ~ result  = "337ef219-94f6-1ad2-9212-125be7321f7d" -> (known after apply)
    }

  # module.actions-runner.module.userdata.data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.actions-runner-noble.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_deregistration"
      ~ last_modified                  = "2025-05-13T15:00:47.000+0000" -> (known after apply)
      ~ s3_key                         = "6acda818-aece-5cba-62d9-3881000011bb.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ASG_NAME"                         = "actions-runner-20250505203133193000000009-KWX4No"
              - "GH_APP_ID"                        = "1016363"
              - "GITHUB_ORG_NAME"                  = "infrahouse"
              - "GITHUB_SECRET"                    = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              - "GITHUB_SECRET_TYPE"               = "pem"
              - "REGISTRATION_TOKEN_SECRET_PREFIX" = "GH-reg-token-c7Iwrd"
            } -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/6acda818-aece-5cba-62d9-3881000011bb.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "9611a23f39576688e3853298d58806fe-5" -> (known after apply)
      ~ id                            = "6acda818-aece-5cba-62d9-3881000011bb.zip" -> (known after apply)
      ~ key                           = "6acda818-aece-5cba-62d9-3881000011bb.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/6acda818-aece-5cba-62d9-3881000011bb.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.deregistration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5398853791252435764" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "c9bc5cebad6b81307c300f8d1e09723a" -> "6538831741a0f02462174590f7abb061"
          ~ "main_version"         = "0610829c0e634ca072d657f4557e894f" -> "8694bd493be5ffcf3fe3e600bf01c93c"
        }
    }

  # module.actions-runner-noble.module.deregistration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "6acda818-aece-5cba-62d9-3881000011bb" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "0610829c0e634ca072d657f4557e894f" -> "8694bd493be5ffcf3fe3e600bf01c93c"
          ~ "requirements.txt" = "c9bc5cebad6b81307c300f8d1e09723a" -> "6538831741a0f02462174590f7abb061"
        }
      ~ result  = "6acda818-aece-5cba-62d9-3881000011bb" -> (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_record_metric"
      ~ last_modified                  = "2025-05-13T01:38:21.645+0000" -> (known after apply)
      ~ s3_key                         = "4a5bd7be-8de0-6ef7-dc8b-630eb6cbf47e.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "ASG_NAME"           = "actions-runner-20250505203133193000000009-KWX4No"
              - "GH_APP_ID"          = "1016363"
              - "GITHUB_ORG_NAME"    = "infrahouse"
              - "GITHUB_SECRET"      = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              - "GITHUB_SECRET_TYPE" = "pem"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/4a5bd7be-8de0-6ef7-dc8b-630eb6cbf47e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "c271ac6e82edc0187a335ded163f42b2-5" -> (known after apply)
      ~ id                            = "4a5bd7be-8de0-6ef7-dc8b-630eb6cbf47e.zip" -> (known after apply)
      ~ key                           = "4a5bd7be-8de0-6ef7-dc8b-630eb6cbf47e.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/record_metric/4a5bd7be-8de0-6ef7-dc8b-630eb6cbf47e.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "3198738620691547594" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "b27996808eca928c3e27d41ab0ab456d" -> "6538831741a0f02462174590f7abb061"
          ~ "main_version"         = "009a1509fd6c7174d1f87bf6bac70353" -> "c5ae631ac191c42c94824edb808a790e"
        }
    }

  # module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "4a5bd7be-8de0-6ef7-dc8b-630eb6cbf47e" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "009a1509fd6c7174d1f87bf6bac70353" -> "c5ae631ac191c42c94824edb808a790e"
          ~ "requirements.txt" = "b27996808eca928c3e27d41ab0ab456d" -> "6538831741a0f02462174590f7abb061"
        }
      ~ result  = "4a5bd7be-8de0-6ef7-dc8b-630eb6cbf47e" -> (known after apply)
    }

  # module.actions-runner-noble.module.userdata.data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

Plan: 14 to add, 8 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDE0LCAiY2hhbmdlIjogOCwgImRlc3Ryb3kiOiAxMn19
```
</details>